In [5]:
import pandas as pd
import os
import platform 
platformName = platform.platform()
if "Windows" in platformName:
    workDir="C:\\Users\\songziheng\\Desktop\\datamining\\kaggle_titanic"
else:
    workDir="/home/szh-921/workSpace/datamining/kaggle_titanic"

In [6]:
trainDf = pd.read_csv(workDir+"/train_dataset.csv")
testDf = pd.read_csv(workDir+"/test_dataset.csv")
sampleSubmmision = pd.read_csv(workDir+"/gender_submission.csv")

In [7]:
trainDf.head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

In [8]:
testDf.head(2)

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S

In [9]:
sampleSubmmision.head(2)

   PassengerId  Survived
0          892         0
1          893         1

In [ ]:
tarinDf.des